app/controllers/remainders_controller.rb

SELECT "remainders".* FROM "remainders"
---
  def index
    @remainders = Remainder.all

INSERT INTO "remainders" ("name", "schedule_interval", "message", "group_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "abcd"], ["schedule_interval", ""], ["message", ""], ["group_id", 1], ["created_at", "2016-03-15 05:25:24.778926"], ["updated_at", "2016-03-15 05:25:24.778926"]]
---
  def create
    @remainder = @group.remainders.new(remainder_params)
    respond_to do |format|
      if @remainder.save

DELETE FROM "remainders" WHERE "remainders"."id" = ?  [["id", 1]]
---
  def destroy
    @remainder.destroy

SELECT  "remainders".* FROM "remainders" WHERE "remainders"."id" = ? LIMIT 1  [["id", 3]]
---
    def set_remainder
      @remainder = Remainder.find(params[:id])

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", nil]]
---
    def set_group
      @group = Group.find(params[:group_id])